In [187]:
import pandas as pd

In [188]:
name=pd.Series(["Dev","Indra","Bakhati"])
salary=pd.Series([1000,2000,3000])

In [189]:
df=pd.DataFrame({"Name":name,"Salary":salary})

In [190]:
df

      Name  Salary
0      Dev    1000
1    Indra    2000
2  Bakhati    3000

In [191]:
minimum=min(df["Salary"])
maximum=max(df["Salary"])

In [192]:
def normalize(df):
    data  = df["Salary"]
    df["Salary"] = [round((i-data.min())/(data.max()-data.min()),2) for i in data]
    return df
print(normalize(df))

      Name  Salary
0      Dev     0.0
1    Indra     0.5
2  Bakhati     1.0

In [193]:
def normalize(df):
    data=df["Salary"]
    
    df["Salary"]=[round((i-data.min())/(data.max()-data.min()),2) for i in data]
    return df
print(normalize(df))

      Name  Salary
0      Dev     0.0
1    Indra     0.5
2  Bakhati     1.0

In [194]:

def normalize(df):
    for i in df["Salary"]:
        df["Salary"]=(i-minimum)/(maximum-minimum)
    return df

In [195]:
print(normalize(df))

      Name  Salary
0      Dev -0.4995
1    Indra -0.4995
2  Bakhati -0.4995

## isnull() and isna()   (same both)

In [196]:
Name=pd.Series(["Hari","Ram","Sita","Dev"])
Age=pd.Series([24,25])

In [197]:
df2=pd.DataFrame({"Name":Name,"Age":Age})

In [198]:
df2

   Name   Age
0  Hari  24.0
1   Ram  25.0
2  Sita   NaN
3   Dev   NaN

In [199]:
df2.head(2)

   Name   Age
0  Hari  24.0
1   Ram  25.0

In [200]:
df2.tail(2)

   Name  Age
2  Sita  NaN
3   Dev  NaN

In [201]:
df2.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False   True

In [202]:
df2.isna()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False   True

In [203]:
df2.isna().sum()       #important

Name    0
Age     2
dtype: int64

## Fillna(value)

In [204]:
# df2.fillna(0,inplace=True)

In [205]:
df2

   Name   Age
0  Hari  24.0
1   Ram  25.0
2  Sita   NaN
3   Dev   NaN

## Dropna()

In [206]:
df2.dropna(how="all")    #all the value of row should be NaN

   Name   Age
0  Hari  24.0
1   Ram  25.0
2  Sita   NaN
3   Dev   NaN

In [212]:
 df2.dropna(how="any")    # at least one value of the row can be NaN

   Name   Age
0  Hari  24.0
1   Ram  25.0

## Replace

In [213]:
df2.replace(to_replace=NaN,value=2)

NameError: name 'NaN' is not defined